---
kind: property
id: P:Autodesk.Revit.DB.ParameterTypeId.WallBottomExtensionDistParam
source: html/89714ee1-6f39-957c-4902-dcce6d36573c.htm
---
# Autodesk.Revit.DB.ParameterTypeId.WallBottomExtensionDistParam Property

"Base Extension Distance"

## Syntax (C#)
```csharp
public static ForgeTypeId WallBottomExtensionDistParam { get; }
```